% 通过原始数据生成拟合的光谱曲线
function [s488,s555,sbg] = gen_spectrum(x1,x2,step)

x = x1:step:x2;
%% 488
a1 =       29.29;
b1 =       545.2;
c1 =       30.55;
a2 =       50.84;
b2 =       524.7;
c2 =       18.04 ;
a3 =       45.29;
b3 =         513;
c3 =       13.99;
a4 =     -0.1872;
b4 =         495;
c4 =      0.2051;
a5 =       6.763;
b5 =       575.4;
c5 =        53.2;
s488 =  a1*exp(-((x-b1)/c1).^2) + a2*exp(-((x-b2)/c2).^2) + a3*exp(-((x-b3)/c3).^2) + a4*exp(-((x-b4)/c4).^2) + a5*exp(-((x-b5)/c5).^2);
s488=s488/100;

figure,plot(x,s488*100,'color',[0,0.5,0],'LineWidth',2);  

%% 555
a1 =       58.91;
b1 =       570.3;
c1 =       15.84;
a2 =      -10.68;
b2 =       598.4;
c2 =       15.21;
a3 =       33.91;
b3 =       563.2;
c3 =       11.15;
a4 =       39.67;
b4 =       600.1;
c4 =          27;
a5 =       12.07;
b5 =       627.5;
c5 =       60.91;


s555 =  a1*exp(-((x-b1)/c1).^2) + a2*exp(-((x-b2)/c2).^2) + a3*exp(-((x-b3)/c3).^2) + a4*exp(-((x-b4)/c4).^2) + a5*exp(-((x-b5)/c5).^2);
s555 = s555/100;
hold on;
plot(x,s555*100,'b','LineWidth',2);          




sigma = 50000;
sbg = 100*exp(-(x-500).^2/sigma);
sbg = sbg/100;
hold on;
plot(x,sbg*100,'r','LineWidth',2);  
axis([min(x)-10 max(x)+10 0 105]);
end

       